wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_nfca_usb.c
	NVIC_EnableIRQ(GPIOB_IRQn);
	R16_PB_INT_IF = (PB8 & ~PB); // reset PB8/PB22 flag
	R16_PB_INT_EN |= (PB8 & ~PB); // enable PB8/PB22 interrupt

	SYS_SAFE_ACCESS(
		R8_SLP_WAKE_CTRL |= (RB_WAKE_EV_MODE | RB_SLP_GPIO_WAKE);
		R8_SLP_POWER_CTRL &= ~(RB_WAKE_DLY_MOD);
		R8_SLP_POWER_CTRL |= 0x00; // 0x00: long delay, 0x01: short delay (short doesn't work here)
	);
}

int HandleSetupCustom( struct _USBState * ctx, int setup_code) {
	return 0;
}

int HandleInRequest( struct _USBState * ctx, int endp, uint8_t * data, int len ) {
	return 0;
}

__HIGH_CODE
void HandleDataOut( struct _USBState * ctx, int endp, uint8_t * data, int len ) {
	// this is actually the data rx handler
	if ( endp == 0 ) {
		// this is in the hsusb.c default handler
		ctx->USBHS_SetupReqLen = 0; // To ACK
	}
	else if( endp == USB_EP_RX ) {
		if(len == 4 && ((uint32_t*)data)[0] == 0x010001a2) {
			USBHSReset();
			blink(2);
			jump_isprom();
		}
		else if( ((uint16_t*)gs_usb_data_buf)[0] == 0 ) {
			((uint16_t*)gs_usb_data_buf)[0] = len;
			mcpy_raw(&gs_usb_data_buf[2], data, data +len);
		}
		else {
			// previous usb buffer not consumed yet, what should we do?
		}

		ctx->USBHS_Endp_Busy[USB_EP_RX] = 0;
	}
}

__INTERRUPT
__HIGH_CODE
void NFC_IRQHandler(void) {
	// Read the interrupt status and write it back to clear the flags.
	uint16_t intf_status = R16_NFC_INTF_STATUS;
	R16_NFC_INTF_STATUS = intf_status;

	// --- State 1: TRANSMITTING ---
	if (g_nfca_pcd_comm_status == 1) {
		// Check if the TX FIFO is ready for more data (TX FIFO Empty flag)
		if ((intf_status & 8) && (g_nfca_pcd_send_fifo_bytes < g_nfca_pcd_send_total_bytes)) {
			// Refill the FIFO with up to 5 words
			for (int i = 0; i < 5; i++) {
				R16_NFC_FIFO = gs_nfca_data_buf[g_nfca_pcd_send_fifo_bytes++];
				if (g_nfca_pcd_send_fifo_bytes >= g_nfca_pcd_send_total_bytes) {
					break;
				}
			}
		}

		// Check if the transmission has completed (TX Complete flag)
		if (intf_status & 1) {

			// If mode is Transceive, switch to receive mode
			R8_NFC_CMD &= ~(0x01); // Clear the Start TX bit
			if (g_nfca_pcd_intf_mode) {
				g_nfca_pcd_recv_bits = 0;
				g_nfca_pcd_recv_word_idx = 0;

				// Set control register based on mode (e.g., enable parity)
				R8_NFC_STATUS = (g_nfca_pcd_intf_mode & 0x10) ? 0x36 : 0x26;

				g_nfca_pcd_comm_status = 2; // Change state to Receiving
				R8_NFC_CMD |= 0x18; // Enable RX
			} 
			// If mode is Transmit-only, the operation is complete
			else {
				R8_NFC_STATUS = 0;
				g_nfca_pcd_comm_status = 5; // Status: Success
			}
		}
	}
	// --- State 2: RECEIVING ---
	else if (g_nfca_pcd_comm_status == 2) {
		// Check if there is data in the RX FIFO (FIFO Not Empty flag)
		if (intf_status & 4) { // Note: OV flag is used for Not Empty
			// Drain up to 5 words from the FIFO
			for (int i = 0; i < 5; i++) {
				gs_nfca_data_buf[g_nfca_pcd_recv_word_idx++] = R16_NFC_FIFO;
			}
		}

		// Check if the reception has completed (RX Complete flag)
		if (intf_status & 2) {
			g_nfca_pcd_recv_bits = R16_NFC_RXTX_LEN;
			uint16_t received_words = (g_nfca_pcd_recv_bits + 15) / 16;

			// Drain any final words left in the FIFO
			if (g_nfca_pcd_recv_word_idx < received_words) {
				uint16_t words_to_drain = received_words - g_nfca_pcd_recv_word_idx;
				for (int i = 0; i < words_to_drain; i++) {
					gs_nfca_data_buf[g_nfca_pcd_recv_word_idx++] = R16_NFC_FIFO;
				}
			}
			g_nfca_pcd_comm_status = 5; // Status: Success
		}
		// Check for error flags
		else if (intf_status & 0x10) {
			g_nfca_pcd_recv_bits = R16_NFC_RXTX_LEN;
			// Drain FIFO on error
			uint16_t received_words = (g_nfca_pcd_recv_bits + 15) / 16;
			if (g_nfca_pcd_recv_word_idx < received_words) {
				uint16_t words_to_drain = received_words - g_nfca_pcd_recv_word_idx;
				for (int i = 0; i < words_to_drain; i++) {
					gs_nfca_data_buf[g_nfca_pcd_recv_word_idx++] = R16_NFC_FIFO;
				}
			}
			g_nfca_pcd_comm_status = 3; // Status: Parity Error
		}
		else if (intf_status & 0x20) {
			g_nfca_pcd_comm_status = 4; // Status: CRC Error
		}
	}
	// --- Any Other State: ERROR ---
	else {
		g_nfca_pcd_comm_status = 6; // Status: General Error
	}
}

uint16_t sys_get_vdd(void) {
	uint8_t  sensor, channel, config, tkey_cfg;
	uint16_t adc_data;

	tkey_cfg = R8_TKEY_CFG;
	sensor = R8_TEM_SENSOR;
	channel = R8_ADC_CHANNEL;
	config = R8_ADC_CFG;

	R8_TKEY_CFG &= ~RB_TKEY_PWR_ON;
	R8_ADC_CHANNEL = CH_INTE_VBAT;
	R8_ADC_CFG = RB_ADC_POWER_ON | RB_ADC_BUF_EN | (0 << 4);
	R8_ADC_CONVERT &= ~RB_ADC_PGA_GAIN2;
	R8_ADC_CONVERT |= (3 << 4);
	R8_ADC_CONVERT |= RB_ADC_START;
	while (R8_ADC_CONVERT & RB_ADC_START);
	adc_data = R16_ADC_DATA;

	R8_TEM_SENSOR = sensor;
	R8_ADC_CHANNEL = channel;
	R8_ADC_CFG = config;
	R8_TKEY_CFG = tkey_cfg;
	return (adc_data);
}

int ADC_VoltConverSignalPGA_MINUS_12dB(uint16_t adc_data) {
	return (((int)adc_data*1050+256)/512 - 3*1050);
}

void nfca_init() {
	funPinMode( PA7, GPIO_CFGLR_IN_FLOAT ); // NFC CTR
	R32_PIN_IN_DIS |= PA7; // disable PA7 digital input

	funPinMode( (PB8 | PB9 | PB16 | PB17), GPIO_CFGLR_IN_FLOAT );
	R32_PIN_IN_DIS |= (((PB8 | PB9) & ~PB) << 16); // disable PB8 PB9 digital input
	R16_PIN_CONFIG |= (((PB16 | PB17) & ~PB) >> 8); // gpio alt func
}

// NFCA PCD functions
void nfca_pcd_start(void) {
	R8_NFC_CMD = 0x24;
	R32_NFC_DRV &= 0xe7ff;
	NVIC_ClearPendingIRQ(NFC_IRQn);
	NVIC_EnableIRQ(NFC_IRQn);
}

void nfca_pcd_stop(void) {
	R8_NFC_STATUS = 0;
	R8_NFC_CMD = 0;
	NVIC_DisableIRQ(NFC_IRQn);
}

void nfca_pcd_wait_ms(uint32_t milliseconds) {
	uint32_t ticks = milliseconds * NFCA_PCD_TICKS_PER_MILLISECOND;

	if (ticks > 0xFFFF) {
		ticks = 0xFFFF;
	}

	R16_NFC_TMR = (uint16_t)ticks;
}

void nfca_pcd_wait_us(uint32_t microseconds) {
	uint64_t ticks = ((uint64_t)microseconds * NFCA_PCD_TICKS_PER_MILLISECOND) / 1000;

	if (ticks > 0xFFFF) {
		ticks = 0xFFFF;
	}

	R16_NFC_TMR = (uint16_t)ticks;
}

void nfca_pcd_lpcd_calibration() {
	uint8_t sensor, channel, config, tkey_cfg;
	uint32_t adc_all;
	uint16_t adc_max, adc_min, adc_value;

