wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_nfca_usb.c
nfca_pcd_controller_state_t nfca_pcd_wait_comm_end(void) {
	nfca_pcd_controller_state_t status;
	uint32_t overtimes;

	overtimes = 0;

	while (1) {
		status = nfca_pcd_get_comm_status();
		if ((status != NFCA_PCD_CONTROLLER_STATE_FREE) || (overtimes > (NFCA_PCD_WAIT_MAX_MS * 10))) {
			break;
		}

		Delay_Us(100);
		overtimes++;
	}

	return status;
}

uint16_t nfca_pcd_lpcd_adc_filter_buf_add(uint16_t lpcd_adc) {
	uint32_t lpcd_adc_all = 0;
	for(uint8_t i = 0; i < 7; i++) {
		gs_lpcd_adc_filter_buf[i] = gs_lpcd_adc_filter_buf[i + 1];
		lpcd_adc_all = lpcd_adc_all + gs_lpcd_adc_filter_buf[i];
	}
	gs_lpcd_adc_filter_buf[7] = lpcd_adc;
	lpcd_adc_all = lpcd_adc_all + gs_lpcd_adc_filter_buf[7];
	lpcd_adc_all = (lpcd_adc_all >> 3);
	return (uint16_t)lpcd_adc_all;
}

__HIGH_CODE
uint8_t nfca_pcd_lpcd_check(void) {
	uint32_t adc_value_diff;
	uint16_t adc_value;
	uint8_t res = 0;

	adc_value = nfca_adc_get_ant_signal();
	if(adc_value > gs_lpcd_adc_base_value) {
		adc_value_diff = adc_value - gs_lpcd_adc_base_value;
	}
	else {
		adc_value_diff = gs_lpcd_adc_base_value - adc_value;
	}
	adc_value_diff = (adc_value_diff * 1000) / gs_lpcd_adc_base_value;

	if((adc_value > gs_lpcd_adc_base_value) && (adc_value_diff > NFCA_PCD_LPCD_THRESHOLD_MAX_LIMIT_PERMIL)) {
		adc_value = ((uint32_t)gs_lpcd_adc_base_value * (1000 + NFCA_PCD_LPCD_THRESHOLD_MAX_LIMIT_PERMIL) / 1000);
	}
	else {
		if(adc_value_diff >= NFCA_PCD_LPCD_THRESHOLD_PERMIL) {
			res = 1;
		}

		if(adc_value < gs_lpcd_adc_base_value) {
			adc_value = gs_lpcd_adc_base_value - 1;
		}
	}

	gs_lpcd_adc_base_value = nfca_pcd_lpcd_adc_filter_buf_add(adc_value);
	return res;
}

// ISO 14443-3A functions
__HIGH_CODE
uint16_t ISO14443_CRCA(uint8_t *buf, int len) {
	uint8_t *data = buf;
	uint16_t crc = 0x6363;
	uint8_t ch;
	while (len--) {
		ch = *data++ ^ crc;
		ch = ch ^ (ch << 4);
		crc = (crc >> 8) ^ (ch << 8) ^ (ch << 3) ^ (ch >> 4);
	}
	return crc;
}

__HIGH_CODE
uint16_t ISO14443AAppendCRCA(void *buf, uint16_t len) {
	uint16_t crc = 0x6363;
	uint8_t *data = (uint8_t *) buf;
	uint8_t byte8 = 0;

	while (len--) {
		byte8 = *data++;
		byte8 ^= crc & 0xFF;
		byte8 ^= byte8 << 4;

		crc = ((((uint16_t)byte8 << 8) | (((crc) >> 8) & 0xFF))
				^ (uint8_t)(byte8 >> 4)
				^ ((uint16_t)byte8 << 3));
	}

	data[0] = (crc >> 0) & 0x00FF;
	data[1] = (crc >> 8) & 0x00FF;

	return crc;
}

__HIGH_CODE
uint8_t ISO14443ACheckOddParityBit(uint8_t *data, uint8_t *parity, uint16_t len) {
	for (int i = 0; i < len; i++) {
		if ((byteParityBitsTable[data[i]]) != parity[i]) {
			return 0;
		}
	}
	return 1;
}

__HIGH_CODE
void ISO14443ACalOddParityBit(uint8_t *data, uint8_t *out_parity, uint16_t len) {
	for (int i = 0; i < len; i++) {
		out_parity[i] = byteParityBitsTable[data[i]];
	}
}

// PCD functions
__HIGH_CODE
int PcdReq(int cmd, uint8_t *data, int len) {
	uint16_t res = PCD_COMMUNICATE_ERROR;
	int comm_len = 0;

	if(cmd != CMD_RBLOCK) {
		// clear chaining buffers
		for(int i = 0; i < NFCA_PCD_CHAINING_BUFFERS; i++) {
			g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)] = 0;
		}
	}

	switch(cmd) {
	case CMD_REQA:
	case CMD_WUPA:
		g_nfca_pcd_send_buf[0] = cmd;
		nfca_pcd_wait_us(200);
		comm_len = 7;
		break;
	case CMD_HALT:
		g_nfca_pcd_send_buf[0] = CMD_HALT;
		g_nfca_pcd_send_buf[1] = 0;
		len = 2;
		comm_len = (len +2) * 8;

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);	
		nfca_pcd_wait_ms(5);
		break;
	case CMD_ANTICOLL1:
	case CMD_ANTICOLL2:
	case CMD_ANTICOLL3:
		if(len == 2) {
			g_nfca_pcd_send_buf[0] = cmd;
			g_nfca_pcd_send_buf[1] = 0x20;
			comm_len = len *8;

			ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len);
			nfca_pcd_wait_ms(PCD_ANTICOLL_OVER_TIME);
		}
		else {
			g_nfca_pcd_send_buf[0] = cmd;
			g_nfca_pcd_send_buf[1] = 0x70;
			g_nfca_pcd_send_buf[6] = 0;
			for(int i = 0; i < 4; i++) {
				g_nfca_pcd_send_buf[i + 2] = data[i];
				g_nfca_pcd_send_buf[6] ^= data[i];
			}
			len = 7;
			comm_len = (len +2) * 8;

			ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
			ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
			nfca_pcd_wait_ms(PCD_SELECT_OVER_TIME);
		}
		break;
	case CMD_RATS:
		g_nfca_pcd_send_buf[0] = CMD_RATS;
		g_nfca_pcd_send_buf[1] = 0x80; // FSDI, max frame size 256
		len = 2;
		comm_len = (len +2) * 8;
		apdu_iblock_number = 0x02; // we'll start with apdu's in i-blocks after this

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
		nfca_pcd_wait_ms(PCD_APDU_OVER_TIME);
		break;
	case CMD_IBLOCK:
		g_nfca_pcd_send_buf[0] = apdu_iblock_number;
		apdu_iblock_number ^= 1;
		for(int i = 0; i < len; i++) {
			g_nfca_pcd_send_buf[i +1] = data[i];
		}
		len++;
		comm_len = (len +2) * 8;

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
		nfca_pcd_wait_ms(PCD_APDU_OVER_TIME);
		break;
	case CMD_WTX:
		g_nfca_pcd_send_buf[0] = data[0];
		g_nfca_pcd_send_buf[1] = data[1];
		len = 2;
		comm_len = (len +2) * 8;

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
		break;
	case CMD_RBLOCK:
		g_nfca_pcd_send_buf[0] = cmd + apdu_iblock_number;
		apdu_iblock_number ^= 1;
		len = 1;
		comm_len = (len +2) * 8;

		ISO14443AAppendCRCA(g_nfca_pcd_send_buf, len);
		ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, len +2);
		break;
	}

	if (nfca_pcd_comm(comm_len, NFCA_PCD_REC_MODE_NORMAL, 0) == 0) {
		if(nfca_pcd_wait_comm_end() == NFCA_PCD_CONTROLLER_STATE_DONE) {
			if (g_nfca_pcd_recv_bits % 9 == 0) {
				int nbytes = g_nfca_pcd_recv_bits /9;
				if (ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, nbytes)) {
					if ((cmd == CMD_REQA) || (cmd == CMD_WUPA)) {
						res = PCD_NO_ERROR;
					}
					else if (((cmd == CMD_ANTICOLL1) || (cmd == CMD_ANTICOLL2) || (cmd == CMD_ANTICOLL3)) && g_nfca_pcd_send_buf[1] == 0x20) {
						if (ISO14443A_CHECK_BCC(g_nfca_pcd_recv_buf)) {
							res = PCD_NO_ERROR;
						}
						else {
							res = PCD_BCC_ERROR;
						}
					}
					else if (ISO14443_CRCA(g_nfca_pcd_recv_buf, nbytes) == 0) {
						res = PCD_NO_ERROR;
					}
					else {
						res = PCD_CRC_ERROR;
					}
				}
				else {
					res = PCD_ODD_PARITY_ERROR;
				}
			}
			else {
				// recv_bits not multiple of 9
				res = PCD_FRAME_ERROR;
			}
		}
	}

	// handle sblocks and rblocks
	if(res == PCD_NO_ERROR) {
		if(g_nfca_pcd_recv_buf[0] == CMD_WTX) {
			res = PcdReq(CMD_WTX, g_nfca_pcd_recv_buf, 2);
		}
		else if ((g_nfca_pcd_recv_buf[0] & 0x10) && ((cmd == CMD_IBLOCK) || (cmd == CMD_RBLOCK))) {
			// Chaining bit is set, copy receive buffer to available chain buffer
			for(int i = 0; i < NFCA_PCD_CHAINING_BUFFERS; i++) {
				if(g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)] == 0) {
					for(int j = 0; j < sizeof(g_nfca_pcd_recv_buf); j++) {
						g_nfca_pcd_recv_buf_chain[(i * sizeof(g_nfca_pcd_recv_buf)) +j] = g_nfca_pcd_recv_buf[j];
					}
					break;
				}
			}
			res = PcdReq(CMD_RBLOCK, 0, 0); // we are ready, request the next part of the chained frame
		}
	}

	return res;
}


// main process loop functions

__HIGH_CODE
void process_usb_packet(void) {
	// Check if we have received a packet in the global buffer
	if( ((uint16_t*)gs_usb_data_buf)[0]  ) {
		uint16_t len = ((uint16_t*)gs_usb_data_buf)[0];
		volatile uint8_t* data = &gs_usb_data_buf[2];

		// Handle specific commands here if needed (e.g. configuration)
		//

