wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_nfca_usb.c
		// If we receive data but we aren't in card_interaction,
		// it might be a mistake or a re-sync. Clear the buffer.
		((uint16_t*)gs_usb_data_buf)[0] = 0;
	}
}

__HIGH_CODE
void send_heartbeat_if_free(void) {
	const char *version = "nfca585 v1";
	// Only send if endpoint is free to avoid blocking
	if( !(USBHSCTX.USBHS_Endp_Busy[USB_EP_TX] & 1) ) {
		USBHS_SendEndpointNEW( USB_EP_TX, (uint8_t*)version, strlen(version), 1 );
	}
}

__HIGH_CODE
int usb_send_blocking(const uint8_t *data, uint16_t len, uint32_t timeout_ms) {
	uint32_t timeout = SysTick->CNTL + Ticks_from_Ms(timeout_ms);

	while (USBHSCTX.USBHS_Endp_Busy[USB_EP_TX] & 1) {
		if (SysTick->CNTL >= timeout) {
			return 0;
		}
	}

	USBHS_SendEndpointNEW(USB_EP_TX, (uint8_t *)data, len, 1);
	return 1;
}

__HIGH_CODE
void usb_send_ntag_version_packet(int uid_len) {
	uint8_t packet[1 +1 +10 +NTAG21X_VERSION_LEN];

	packet[0] = USB_PKT_NTAG_VERSION;
	packet[1] = uid_len;
	for (int i = 0; i < 10; ++i) {
		packet[2 +i] = (i < uid_len) ? gs_picc_uid[i] : 0;
	}
	for (int i = 0; i < NTAG21X_VERSION_LEN; ++i) {
		packet[12 +i] = g_last_ntag_version[i];
	}

	usb_send_blocking(packet, sizeof(packet), 50);
}

__HIGH_CODE
void usb_send_ntag_page_packet(uint8_t start_page, const uint8_t *page_data, uint8_t page_count) {
	uint8_t packet[3 +(4 *4)];
	uint8_t copy_len = page_count * 4;

	packet[0] = USB_PKT_NTAG_PAGE_DATA;
	packet[1] = start_page;
	packet[2] = page_count;
	for (int i = 0; i < 16; ++i) {
		packet[3 +i] = (i < copy_len) ? page_data[i] : 0;
	}

	usb_send_blocking(packet, sizeof(packet), 50);
}

__HIGH_CODE
void usb_send_ntag_done_packet(uint8_t status_code) {
	uint8_t packet[2] = { USB_PKT_NTAG_DONE, status_code };
	usb_send_blocking(packet, sizeof(packet), 50);
}

__HIGH_CODE
int ntag_get_version(void) {
	g_nfca_pcd_send_buf[0] = CMD_T2T_GET_VERSION;
	ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, 1);
	nfca_pcd_wait_ms(PCD_T2T_OVER_TIME);

	if (nfca_pcd_comm(8, NFCA_PCD_REC_MODE_NORMAL, 0) != 0) {
		return 0;
	}
	if (nfca_pcd_wait_comm_end() != NFCA_PCD_CONTROLLER_STATE_DONE) {
		return 0;
	}
	if ((g_nfca_pcd_recv_bits % 9) != 0) {
		return 0;
	}

	int nbytes = g_nfca_pcd_recv_bits / 9;
	if (nbytes != (NTAG21X_VERSION_LEN +2)) {
		return 0;
	}
	if (!ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, nbytes)) {
		return 0;
	}
	if (ISO14443_CRCA(g_nfca_pcd_recv_buf, nbytes) != 0) {
		return 0;
	}

	for (int i = 0; i < NTAG21X_VERSION_LEN; ++i) {
		g_last_ntag_version[i] = g_nfca_pcd_recv_buf[i];
	}

	return 1;
}

__HIGH_CODE
int ntag_is_ntag215(void) {
	return (g_last_ntag_version[1] == 0x04) &&
	       (g_last_ntag_version[2] == 0x04) &&
	       (g_last_ntag_version[3] == 0x02) &&
	       (g_last_ntag_version[6] == 0x11);
}

__HIGH_CODE
int ntag_read_pages(uint8_t start_page) {
	g_nfca_pcd_send_buf[0] = CMD_T2T_READ;
	g_nfca_pcd_send_buf[1] = start_page;
	ISO14443AAppendCRCA(g_nfca_pcd_send_buf, 2);
	ISO14443ACalOddParityBit(g_nfca_pcd_send_buf, g_nfca_parity_buf, 4);
	nfca_pcd_wait_ms(PCD_T2T_OVER_TIME);

	if (nfca_pcd_comm(32, NFCA_PCD_REC_MODE_NORMAL, 0) != 0) {
		return 0;
	}
	if (nfca_pcd_wait_comm_end() != NFCA_PCD_CONTROLLER_STATE_DONE) {
		return 0;
	}
	if ((g_nfca_pcd_recv_bits % 9) != 0) {
		return 0;
	}

	int nbytes = g_nfca_pcd_recv_bits / 9;
	if (nbytes != (NTAG_T2T_READ_BYTES +2)) {
		return 0;
	}
	if (!ISO14443ACheckOddParityBit(g_nfca_pcd_recv_buf, g_nfca_parity_buf, nbytes)) {
		return 0;
	}

	return ISO14443_CRCA(g_nfca_pcd_recv_buf, nbytes) == 0;
}

__HIGH_CODE
void ntag_dump_read_only(int uid_len) {
	uint8_t page_starts[(NTAG215_TOTAL_PAGES +3) /4];
	int page_start_count = 0;

	for (uint8_t page = 0; page <= 128; page += 4) {
		page_starts[page_start_count++] = page;
	}
	page_starts[page_start_count++] = 131;

	if (!ntag_get_version()) {
		usb_send_ntag_done_packet(1);
		return;
	}

	if (!ntag_is_ntag215()) {
		usb_send_ntag_done_packet(2);
		return;
	}

	usb_send_ntag_version_packet(uid_len);

	for (int i = 0; i < page_start_count; ++i) {
		uint8_t start_page = page_starts[i];
		uint8_t valid_pages = 4;

		if ((start_page +4) > NTAG215_TOTAL_PAGES) {
			valid_pages = NTAG215_TOTAL_PAGES - start_page;
		}

		if (!ntag_read_pages(start_page)) {
			usb_send_ntag_done_packet(3);
			return;
		}

		usb_send_ntag_page_packet(start_page, g_nfca_pcd_recv_buf, valid_pages);
	}

	usb_send_ntag_done_packet(0);
}

__HIGH_CODE
void card_interaction(int uid_len, int sak) {
	int iso14443_3 = (sak == 0x20);
	int iso14443_3_devtest_jcop = (sak == 0x00 && gs_picc_uid[0] == 0x00);
	int iso14443_3_type2 = (sak == 0x00 && gs_picc_uid[0] != 0x00);
	uint32_t timeout = 0;

	if (iso14443_3_type2) {
		ntag_dump_read_only(uid_len);
		return;
	}

	if(iso14443_3 || iso14443_3_devtest_jcop) {
		if(PcdReq(CMD_RATS, 0, 0) == PCD_NO_ERROR) {
			// Send RATS response to PC
			USBHS_SendEndpointNEW(USB_EP_TX, g_nfca_pcd_recv_buf, g_nfca_pcd_recv_bits /9, 1);

			// Set a timeout for the PC to reply
			timeout = SysTick->CNTL + Ticks_from_Ms(PCD_APDU_OVER_TIME);

			// While waiting for PC response, we block here because timing is strict
			// for the NFC field. Losing the field usually kills the card state.
			while(SysTick->CNTL < timeout) {
				if( *(volatile uint16_t*)gs_usb_data_buf ) {
					// we got a new APDU to send from PC
					if( PcdReq(CMD_IBLOCK, &gs_usb_data_buf[2], ((uint16_t*)gs_usb_data_buf)[0]) == PCD_NO_ERROR ) {
						// Send chained responses
						for(int i = 0; i < NFCA_PCD_CHAINING_BUFFERS; i++) {
							if(g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)]) {
								USBHS_SendEndpointNEW(USB_EP_TX, &g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)], sizeof(g_nfca_pcd_recv_buf), 1);
								g_nfca_pcd_recv_buf_chain[i * sizeof(g_nfca_pcd_recv_buf)] = 0;
							}
							else {
								break;
							}
						}
						// Send final response
						USBHS_SendEndpointNEW(USB_EP_TX, g_nfca_pcd_recv_buf, g_nfca_pcd_recv_bits /9, 1);

						// Reset timeout for next command
						timeout = SysTick->CNTL + Ticks_from_Ms(PCD_APDU_OVER_TIME);
					}

					// Ack processing of buffer
					((uint16_t*)gs_usb_data_buf)[0] = 0;
				}
			}
		}
	}
}

__HIGH_CODE
void main_task_loop() {
	int res = PCD_COMMUNICATE_ERROR;
	int atqa, sak;
	int uuid_len = 0;
	uint32_t next_scan_time = 0;
	uint32_t next_heartbeat_time = 0;

	// Check VDD once at start or periodically if needed
	int vdd_value = ADC_VoltConverSignalPGA_MINUS_12dB( sys_get_vdd() );
	if(vdd_value > 3400)      NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL0);
	else if(vdd_value > 3000) NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL1);
	else if(vdd_value > 2600) NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL2);
	else                      NFCA_PCD_SET_OUT_DRV(NFCA_PCD_DRV_CTRL_LEVEL3);

	while(1) {
		// 1. Always process USB input (e.g. Reboot commands) immediately
		process_usb_packet();

