wrickert/UntitledElectronics/Badges/BsidesDSM26/Code/ch585_nfca_usb.c
		// 2. Handle Heartbeat (Non-blocking)
		if (SysTick->CNTL > next_heartbeat_time) {
			send_heartbeat_if_free();
			next_heartbeat_time = SysTick->CNTL + Ticks_from_Ms(333);
		}

		// 3. Handle NFC Scan (Periodically)
		if (SysTick->CNTL > next_scan_time) {

			nfca_pcd_start();

			// LPCD Check (Fast)
			if(nfca_pcd_lpcd_check()) {

				// Found something!
				// Reset antenna field to wake card
				R8_NFC_CMD &= ~RB_NFC_ANTENNA_ON;
				Delay_Ms(5);
				R8_NFC_CMD |= RB_NFC_ANTENNA_ON;
				Delay_Ms(5);

				// --- ANTICOLLISION SEQUENCE ---
				if(PcdReq(CMD_REQA, 0, 0) == PCD_NO_ERROR) {
					atqa = ((uint16_t *)(g_nfca_pcd_recv_buf))[0];
					PcdReq(CMD_HALT, 0, 0);

					if(PcdReq(CMD_WUPA, 0, 0) == PCD_NO_ERROR) {
						atqa = ((uint16_t *)(g_nfca_pcd_recv_buf))[0];
						Delay_Us(350);
					res = PcdReq(CMD_ANTICOLL1, /*0x20*/0, 2);
					}

					if (res == PCD_NO_ERROR) {
						if(g_nfca_pcd_recv_buf[0] == 0x88) {
							gs_picc_uid[0] = g_nfca_pcd_recv_buf[1];
							gs_picc_uid[1] = g_nfca_pcd_recv_buf[2];
							gs_picc_uid[2] = g_nfca_pcd_recv_buf[3];

							res = PcdReq(CMD_ANTICOLL1, g_nfca_pcd_recv_buf, 7);
							if (res == PCD_NO_ERROR) {
								res = PcdReq(CMD_ANTICOLL2, /*0x20*/0, 2);
								if (res == PCD_NO_ERROR) {
									if(g_nfca_pcd_recv_buf[0] == 0x88) {
										gs_picc_uid[3] = g_nfca_pcd_recv_buf[1];
										gs_picc_uid[4] = g_nfca_pcd_recv_buf[2];
										gs_picc_uid[5] = g_nfca_pcd_recv_buf[3];

										res = PcdReq(CMD_ANTICOLL2, g_nfca_pcd_recv_buf, 7);
										if (res == PCD_NO_ERROR) {
											res = PcdReq(CMD_ANTICOLL3, /*0x20*/0, 2);
											if (res == PCD_NO_ERROR) {
												uuid_len = 10;
												gs_picc_uid[6] = g_nfca_pcd_recv_buf[0];
												gs_picc_uid[7] = g_nfca_pcd_recv_buf[1];
												gs_picc_uid[8] = g_nfca_pcd_recv_buf[2];
												gs_picc_uid[9] = g_nfca_pcd_recv_buf[3];

												res = PcdReq(CMD_ANTICOLL3, g_nfca_pcd_recv_buf, 7);
												if (res == PCD_NO_ERROR) {
													sak = g_nfca_pcd_recv_buf[0];
												}
											}
											else {
												// anticoll3 error
											}
										}
										else {
											// uid1 error
										}
									}
									else {
										// 7 byte uid
										uuid_len = 7;
										gs_picc_uid[3] = g_nfca_pcd_recv_buf[0];
										gs_picc_uid[4] = g_nfca_pcd_recv_buf[1];
										gs_picc_uid[5] = g_nfca_pcd_recv_buf[2];
										gs_picc_uid[6] = g_nfca_pcd_recv_buf[3];

										res = PcdReq(CMD_ANTICOLL2, g_nfca_pcd_recv_buf, 7);
										if (res == PCD_NO_ERROR) {
											sak = g_nfca_pcd_recv_buf[0];
										}
									}
								}
								else {
									// anticoll2 error
								}
							}
							else {
								// uid0 error
							}
						}
						else {
							// 4 byte uid
							uuid_len = 4;
							gs_picc_uid[0] = g_nfca_pcd_recv_buf[0];
							gs_picc_uid[1] = g_nfca_pcd_recv_buf[1];
							gs_picc_uid[2] = g_nfca_pcd_recv_buf[2];
							gs_picc_uid[3] = g_nfca_pcd_recv_buf[3];

							res = PcdReq(CMD_ANTICOLL1, g_nfca_pcd_recv_buf, 7);
							if (res == PCD_NO_ERROR) {
								sak = g_nfca_pcd_recv_buf[0];
							}
						}
					}
					else {
						// anticoll1 error
					}

					if(uuid_len) {
						// Card is fully selected, enter interaction mode
						// This function IS allowed to block because we are in a session
						card_interaction(uuid_len, sak);

						// Clean up
						PcdReq(CMD_HALT, 0, 0);
						atqa = 0;
						sak = 0;
						uuid_len = 0;
					}
				}
			}

			// Turn off NFC to save power/reset state
			nfca_pcd_stop();

			// Schedule next scan for 333ms from NOW
			next_scan_time = SysTick->CNTL + Ticks_from_Ms(333);
		}
	}
}

int main() {
	SystemInit();

	funGpioInitAll(); // no-op on ch5xx
	GPIOSetup();
	USBHSSetup();

	blink(5); // Indicates boot

	nfca_init();
	nfca_pcd_lpcd_calibration();

	main_task_loop(); // Never returns

	while(1);
}
